[
  {
    "id": 1754927364299,
    "name": "Teens Syllabus",
    "price": "50",
    "img": "/uploads/1754927364257.jpg",
    "description": "Church of Pentecost Teens Syllabus"
  },
  {
    "id": 1754928188965,
    "name": "God's Faithfulness",
    "price": "50",
    "img": "/uploads/1754928188926.jpg",
    "description": "God's Faithfulness to The Church of Pentecost"
  },
  {
    "id": 1754928331323,
    "name": "Children's Syllabus",
    "price": "35",
    "img": "/uploads/1754928331290.jpg",
    "description": "Most Christian children do not have a firm grasp of basic Christian doctrines that can guarantee their growth in the Lord and their preparedness for the second coming of Christ. The reason is that they are fed with a simple fare of Bible stories but are not taught what the great truths of the Bible mean to them personally.This syllabus systematically seeks to make practical, informative and inspiring presentations of Biblical truths that will help evangelize children between ages 7 and 9 years and ensure their growth in the Lord Jesus Christ.The writers, who are sensitive to the needs of children, have interestingly and accurately communicated great truths in a style that will strike a responsive chord in both the teachers and children who would benefit from its contents.Parents and children’s workers will find the book of inestimable value to their efforts at winning their children for the Lord and rightly dividing the Word of truth."
  },
  {
    "id": 1754928464174,
    "name": "Managing The Decline of Christianity in the Western World ",
    "price": "50",
    "img": "/uploads/1754928464132.jpg",
    "description": "Managing The Decline of Christianity in the Western World: Lessons for Churches in the Developing World"
  },
  {
    "id": 1754928583556,
    "name": "Syllabus for Young Adults",
    "price": "50",
    "img": "/uploads/1754928583503.jpg",
    "description": "Syllabus for Young Adults, Youth Ministry "
  },
  {
    "id": 1754928940138,
    "name": "Into The World We Go: The Missionary Enterprise of the Church of Pentecost",
    "price": "50",
    "img": "/uploads/1754928940086.jpg",
    "description": "The propagation of the gospel of Jesus Christ is one of the benchmarks of true discipleship. Whether at home or abroad, individually or organisationally, those involved in it demonstrate their love for God and obedience to His command, the Great Commission. The pre-crucified Jesus sent His disciples in twos to go and preach (Luke 10:1). After His resurrection, He gave them the charge beautifully termed, \"The Great Commission\" which made the whole of creation its mission field (Matt. 28:19–20). In that apostolic age, this worldwide dimension of missions took place during three major periods:"
  },
  {
    "id": 1754929141783,
    "name": "Youth Ministry Cloth",
    "price": "120",
    "img": "/uploads/1754929141746.jpeg",
    "description": "Step out in style and purpose with our Youth Ministry Collection — designed for comfort, quality, and bold faith statements. Whether you’re at church, in the community, or hanging out with friends, these clothes are a reminder that you’re part of a movement for Christ."
  },
  {
    "id": 1754940901123,
    "name": "Children’s Ministry @ 50",
    "price": "50",
    "description": "elebrate 50 years of God’s faithfulness to the Children’s Ministry of the Church of Pentecost with this vibrant and comfortable commemorative T-shirt.\r\n\r\nMaterial: Soft, breathable cotton blend – perfect for everyday wear.\r\n\r\nDesign: Features the official Children’s Ministry @ 50 anniversary logo, symbolizing growth, unity, and the next generation for Christ.\r\n\r\nColors: Available in multiple bright, child-friendly colors.\r\n\r\nFit: Unisex sizes for children and youth.\r\n\r\nOccasion: Ideal for anniversary celebrations, church services, outreach programs, and everyday ministry events.",
    "colors": [
      "Violet",
      "Green",
      "Light Green",
      "Red",
      "Orange",
      "Ash",
      "Yellow"
    ],
    "sizes": [
      "xl",
      "l",
      "xxl",
      "s",
      "m"
    ],
    "images": [
      "/uploads/1754940901100.jpeg",
      "/uploads/1754940901102.jpeg",
      "/uploads/1754940901106.jpeg",
      "/uploads/1754940901107.jpeg",
      "/uploads/1754940901108.jpeg",
      "/uploads/1754940901109.jpeg",
      "/uploads/1754940901110.jpeg"
    ]
  }
]